Repository: H3rz3n/davinci-helper
Catalog: davinci-helper/locale/*/LC_MESSAGES/davinci-helper.po
Languages: it

source: Check and install missing dependencies
it: Trova ed installa le dipendenze mancanti

source: This part of the software will install all the dependencies necessary to correctly launch the installation and the execution of DaVinci Resolve. The script will detect your Fedora version and the libraries installed, after that it will install only the packages needed. This script does not collect or diffuse any information about you or your system. The internet connection is required only if there are any missing libraries to install.
it: Questa parte del software installerà tutte le dipendenze necessarie per avviare correttamente l'installazione e l'esecuzione di DaVinci Resolve. Lo script rileverà la tua versione di Fedora e le librerie installate, successivamente installerà solo i pacchetti mancanti. Questo script non raccoglie o diffonde informazioni su di te o il tuo sistema. La connessione internet è richiesta solo in caso ci siano librerie mancanti da installare.

source: Show Info
it: Mostra Info

source: Show logs
it: Mostra log

source: Hide info
it: Nascondi info

source: The dependencies have been correctly installed
it: Le dipendenze sono state installate correttamente

source: All the dependencies have been correctly installed inside the system. Now you can correctly start the DaVinci Resolve installer.
it: Tutte le dipendenze sono state correttamente installate nel sistema. Ora puoi avviare correttamente l'installazione di DaVinci Resolve.

source: There was an error installing the dependencies
it: C'è stato un errore durante l'installazione delle dipendenze

source: There was an error getting what version of Fedora you are using. Please check the logs to have more details.
it: C'è stato un errore nella lettura della versione di Fedora in uso. Per favore, controlla i log per avere maggiori dettagli.

source: There was an error getting the list of the installed libraries on your system. Please check the logs to have more details.
it: C'è stato un errore nella lettura delle librerie installate nel tuo sistema. Per favore, controlla i log per avere maggiori dettagli.

source: There was an error during the installation of the missing libraries. Please check the logs to have more details.
it: C'è stato un errore durante l'installazione delle librerie mancanti. Per favore, controlla i log per avere maggiori dettagli.

source: You need to be an admin to use this function
it: Devi essere un admin per usare questa funzione

source: It was impossible to start this function because you didn't give the necessary root permission for his execution. Try again giving the root permission.
it: È stato impossibile avviare questa funzione perchè non hai dato i permessi di root necessari per la sua esecuzione. Prova nuovamente fornendo i permessi di root.

source: Hide logs
it: Nascondi log

source: The time needed to complete this task will vary on your computer and network performance.
it: Il tempo necessario al completamento di questa operazione può variare a seconda delle performance del tuo PC e della tua connessione di rete.

source: Welcome to DaVinci Helper
it: Benvenuto in DaVinci Helper

source: The best tool for managing DaVinci Resolve on Linux
it: Il migliore strumento per gestire DaVinci Resolve su Linux

source: Launch DaVinci Resolve installation wizard
it: Avvia l'installazione di DaVinci Resolve

source: This part of the software will ask you to indicate the DaVinci Resolve installer file path, then it will run it with the necessary patch to make it launch properly.
it: Questa parte del software ti chiederà di indicare il percorso del file di installazione di DaVinci Resolve, poi applicherà le modifiche necessarie per avviarlo correttamente.

source: Select the DaVinci Resolve installer .zip file
it: Seleziona il file .zip dell'installer di DaVinci Resolve

source: You have successfully started the DaVinci wizard
it: Hai avviato con successo l'installer di DaVinci

source: You have successfully started the DaVinci Resolve installation wizard. Now you can install DaVinci Resolve on your computer.
it: Hai avviato con successo l'Installer di DaVinci Resolve. Ora puoi installare DaVinci Resolve sul tuo computer.

source: There was an error launching the DaVinci wizard
it: C'è stato un errore durante l'avvio dell'installer di DaVinci

source: There was an error extracting the DaVinci Resolve installer zip inside the target folder. Please check the logs to have more details.
it: C'è stato un errore durante l'estrazione dell'installer di DaVinci Resolve all'interno della cartella predefinita. Per favore, controlla i log per avere maggiori dettagli.

source: There was an error launching the DaVinci Resolve installation wizard. Please check the logs to have more details.
it: C'è stato un errore durante l'avvio dell'installer di DaVinci Resolve. Per favore, controlla i log per avere maggiori dettagli.

source: Apply the DaVinci Resolve post installation fix
it: Applica le correzioni post installazione di DaVinci Resolve

source: This part of the software will put some of the dependencies shipped with DaVinci Resolve in a safe folder, in order to make it use the system ones.
it: Questa parte del software trasferirà alcune delle dipendenze predefinite di DaVinci Resolve in una cartella sicura, in modo da forzare l'utilizzo di quelle di sistema.

source: The post installation fix has been correctly applied
it: Le correzioni post installazione sono state applicate correttamente

source: All the problematic libraries have been correctly moved inside the secure folder. Now you can correctly run DaVinci Resolve.
it: Tutte le librerie problematiche sono state spostate correttamente nella cartella sicura. Ora puoi avviare correttamente DaVinci Resolve.

source: There was an error applying the fixes
it: C'è stato un errore durante l'applicazione delle correzioni

source: There was an error finding the DaVinci Resolve installation folder. Please check the logs to have more details.
it: C'è stato un errore nel trovare la cartella di installazione di DaVinci Resolve. Per favore, controlla i log per avere maggiori dettagli.

source: There was an error finding a compatible version of DaVinci Resolve on your system. Please check the logs to have more details.
it: C'è stato un errore nel trovare una versione compatibile di DaVinci Resolve sul tuo sistema. Per favore, controlla i log per avere maggiori dettagli.

source: There was an error during the creation of the libraries' secure folder. Please check the logs to have more details.
it: C'è stato un errore durante la creazione della cartella sicura per le librerie. Per favore, controlla i log per avere maggiori dettagli.

source: There was an error moving the libraries inside the secure folder. Please check the logs to have more details.
it: C'è stato un errore durante il trasferimento delle librerie nella cartella sicura. Per favore, controlla i log per avere maggiori dettagli.

source: Check and install the correct gpu drivers
it: Trova ed installa i corretti driver della GPU

source: This part of the software will check what GPU you are using and then, if it is supported, it will check if the correct drivers are installed. If it finds missing or outdated drivers the software will install them to make your GPU fully support DaVinci Resolve.
it: Questa parte del software controllerà quali GPU sono presenti nel tuo sistema e poi, in caso ne sia trovagta una supportata, controllerà che i corretti driver siano installati. In caso dovesse trovare driver mancanti o datati, il software li installerà per permettere alla tua GPU di supportare completamente DaVinci Resolve.

source: The GPUs drivers have been correctly installed
it: I driver della GPU sono stati installati correttamente

source: All the GPUs drivers have been correctly installed inside the system. Now you can correctly run DaVinci Resolve.
it: Tutti i driver delle GPU sono stati installati correttamente all'interno del sistema. Ora puoi avviare correttamente DaVinci Resolve.

source: There was an error installing the GPUs drivers
it: C'è stato un errore durante l'installazione dei driver della GPU

source: There was an error finding a supported GPU inside your system. Please check the logs to have more details.
it: C'è stato un errore nel trovare una GPU supportata nel tuo sistema. Per favore, controlla i log per avere maggiori dettagli.

source: There was an error while adding the RPM Fusion repository to your system. Please check the logs to have more details.
it: C'è stato un errore nell'aggiungere il repository RPM Fusion al tuo sistema. Per favore, controlla i log per avere maggiori dettagli.

source: There was an error during the installation of the GPUs drivers. Please check the logs to have more details.
it: C'è stato un errore durante l'installazione dei driver delle GPU. Per favore, controlla i log per avere maggiori dettagli.

source: Select a valid file !
it: Seleziona un file valido !

source: It seems like you didn't load any file. Please load a valid DaVinci Resolve installer zip file to continue.
it: Sembra che tu non abbia caricato nessun file. Per favore, carica un file zip dell'installer di Davinci Resolve per continuare.

source: It seems like you tried to load an usupported file. Please load a valid DaVinci Resolve installer zip file to continue. If you have renamed it, remember that the file name must contain the words 'DaVinci', 'Resolve', 'Linux' inside of it and it must to have the '.zip' extension.
it: Sembra che tu abbia provato a caricare un file non supportato. Per favore, carica un file zip dell'installer di DaVinci Resolve per continuare. Se lo hai rinominato, ricorda che il nome del file deve contenere le parole 'DaVinci', 'Resolve', 'Linux' al suo interno e deve avere l'estensione '.zip'.

source: Thank you for installing DaVinci Helper
it: Grazie per aver installato DaVinci Helper

source: Thank you for trusting us and installing DaVinci Helper. We hope that this app will make the management of DaVinci Resolve easier for you.
it: Grazie per aver riposto fiducia in noi ed aver installato DaVinci Helper. Speriamo che questa app vi semplificherà l'utilizzo di DaVinci Resolve su Linux.

source: This app is not affiliated in any way with BlackMagic Design, it's only a community project and comes without any guarantees.
it: Questa app non è in nessun modo associata a BlackMagic Design, è solo un progetto realizzato dalla commmunity e non ha alcuna garanzia.

source: If you find this app useful and want to improve it please consider helping us <a href="https://github.com/H3rz3n/davinci-helper">developing</a> this app or <a href="https://www.paypal.com/donate/?hosted_button_id=CPCG2RFAV82T8">making a donation</a> to the project.
it: Se trovi questa app utile a vorresti migliorarla, puoi aiutarci a <a href="https://github.com/H3rz3n/davinci-helper">svilupparla</a> oppure <a href="https://www.paypal.com/donate/?hosted_button_id=CPCG2RFAV82T8">facendo una donazione</a> al progetto.

source: Don't show again
it: Non mostrare di nuovo

source: Settings restored successfully
it: Impostazioni ripristinate con successo

source: The default app settings have been restored successfully. If you are still experiencing any error or bug, please contact us on the <a href="https://github.com/H3rz3n/davinci-helper/issues">project GitHub page</a>
it: Le impostazioni di default dell'app sono state ripristinate con successo. Se stai ancora riscontrando errori o bug, per favore, contattaci sulla <a href="https://github.com/H3rz3n/davinci-helper/issues">pagina GitHub del progetto</a>

source: A new update is available
it: È disponibile un nuovo aggiornamento

source: A new version of this app has been found. We recommend you to update it before continue using it.
it: È stata trovata una nuova versione di questa app. Ti consigliamo di aggiornare l'app prima di continuare ad usarla.

source: DaVinci Video Converter
it: Convertitore video per DaVinci

source: Exported video settings
it: Impostazioni dei video esportati

source: The time needed to complete this task will vary on your computer and network performance.
it: Il tempo necessario per completare questa operazione può variare a seconda delle performance tuo PC e della tua connessione di rete.

source: Select the converted videos output folder
it: Seleziona la cartella di output deI video convertiti

source: Select the files to convert
it: Seleziona i file da convertire

source: Converting the file : {self.file_name}
it: Convertendo il file : {self.file_name}

source: Finished processing the file : {self.file_name}
it: La conversione del file {self.file_name} è stata completata

source: {self.file_name} - {progress * 100:.2f}%
it: {self.file_name} - {completamento * 100:.2f}%

source: Starting with the next file...
it: Iniziando il prossimo file...

source: Install FFMPEG to use this feature
it: Installa FFMPEG per usare questa funzione

source: FFMPEG was successfully installed
it: FFMPEG è stato installato con successo

source: FFMPEG has been correctly installed inside the system. Now you can start using DaVinci Video Convert.
it: FFMPEG è stato correttamente installato nel sistema. Ora puoi iniziare convertire i video di DaVinci.

source: There was an error installing FFMPEG
it: C'è stato un errore durante l'installazione di FFMPEG

source: There was an error installing FFMPEG from the RPM Fusion repository. Please check the logs to have more details.
it: C'è stato un errore durante l'installazione di FFMPEG dal repository RPM Fusion. Per favore, controlla i logs per avere più dettagli.

source: There was an error swapping FFMPEG lite with FFMPEG full from the RPM Fusion repository. Please check the logs to have more details.
it: C'è stato un errore durante lo scambio di FFMPEG Lite con FFMPEG Full dal repository RPM Fusion. Per favore, controlla i logs per avere più dettagli.

source: This will need a lot of space !
it: Occuperà molto spazio !

source: The conversion of the files using the DNxHD/HR encoder will make new files fully compatible with DaVinci Resolve Free. The use of these uncompressed sources will make your editing experience faster, but it will take a lot of disk space.
it: La conversione dei file usando l'encoder DNxHD/HR renderà i nuovi filecompletamente compatibili con DaVinci Resolve Free. L'uso di queste fonti non compresse renderà la tua esperienza di editing più veloce, ma occuperà molto spazio sul tuo disco.

source: The estimated disk space needed to convert the files is : {space_placeholder}
it: Lo spazio necessario per convertire i file si stima sia : {space_placeholder}

source: If you want to use less disk space please consider using lower video and audio settings.
it: Se vuoi utilizzare meno spazio del disco, prova ad utilizzare impostazioni video e audio più basse.

source: There are some missing modules
it: Ci sono alcuni moduli mancanti

source: There was an error installing the Moviepy python module. Please check the logs to have more details.
it: C'è stato un errore durante l'installazione del modulo python Moviepy. Per favore, controlla i logs per avere più dettagli.

source: Select a valid file
it: Seleziona un file valido

source: It seems like you didn't load any file to convert. Please load at least one supported video file to continue.
it: Sembra che tu non abbia caricato alcun file da convertire. Per favore, carica almeno un file video supportato per continuare.

source: Select a valid file and output folder
it: Seleziona un file e una cartella di output validi

source: It seems like you didn't load any file to convert and you didn't choose any output folder. Please load at least one supported video file and select a valid output folder to continue.
it: Sembra che tu non abbia caricato alcun file da convertire e che non abbia scelto nessuna cartella di output. Per favore, carica almeno un file video supportato e seleziona una cartella di output valida per continuare.

source: Select a valid output folder
it: Seleziona una cartella di output valida

source: It seems like you didn't load any output folder. Please select a valid output folder to continue.
it: Sembra che tu non abbia selezione alcuna cartella di output. Per favore, seleziona una cartella di output valida per continuare.

source: Unsupported files found
it: Trovati file non supportati

source: Some files can't be converted because they are unsupported. If you decide to continue, the following file will not be converted :
it: Alcuni file non possono essere convertiti perchè non sono supportati. Se decidi di continuare, i seguenti file non verranno convertiti :

source: Continue
it: Continua

source: All the files have been converted
it: Tutti i file sono stati convertiti

source: All your files have been correctly converted and placed inside your designed folder.
it: Tutti i tuoi file sono stati convertiti correttamente e salvati all’interno della cartella da te selezionata.

source: Are you sure you want to exit ?
it: Sei sicuro di voler uscire ?

source: The video conversion is still going on, if you exit this app the process will be interupted and you will get only the files converted before the app closure.
it: La conversione dei video è ancora in corso, se esci dall’app il processo verrà interrotto e otterrai solo i file convertiti prima della chiusura dell'app.

source: Continue conversion
it: Continua la conversione

source: Exit app
it: Esci dall'app

source: DEBUG : There was an error reading what version of Fedora is installed :
it: DEBUG : C'è stato un errore durante la lettura della versione di Fedora in uso :

source: Please open an issue report and paste this error code on the project GitHub page :
it: Per favore, apri una segnalazione e copia questo codice di errore nella pagina GitHub dedicata :

source: DEBUG : There was an error reading the library list :
it: DEBUG : C'è stato un errore durante la lettura della lista della librerie installate

source: The following libraries will be installed because they are missing :
it: Le seguenti librerie saranno installate perchè sono mancanti :

source: There are no missing libraries to install, you can now install DaVinci Resolve
it: Non ci sono librerie mancanti da installare, ora puoi installare DaVinci Resolve

source: DEBUG : There was an error installing the missing libraries :
it: DEBUG : C'è stato un errore durante l'installazione delle librerie mancanti :

source: DEBUG : There was an error extracting the DaVinci Resolve installer :
it: DEBUG : C'è stato un errore durante l'estrazione dell'installer di DaVinci Resolve :

source: DEBUG : There was an error launching the DaVinci Resolve installation wizard :
it: DEBUG : C'è stato un errore durante l'avvio dell'installer di DaVinci Resolve

source: DEBUG : It was impossible to find the DaVinci Resolve installation folder in /opt/resolve.
it: DEBUG : È stato impossibile trovare la cartella di installazione di DaVinci Resolve in /opt/resolve.

source: If you haven't done it already, please install DaVinci Resolve and try again.
it: Se non l'hai già fatto, per favore installa DaVinci Resolve e prova di nuovo.

source: DaVinci Resolve 18.x.x was found in the system
it: DaVinci Resolve 18.x.x è stato trovato nel sistema

source: DaVinci Resolve 19.x.x was found in the system
it: DaVinci Resolve 19.x.x è stato trovato nel sistema

source: DEBUG : An installed version of DaVinci that is not currently supported was found.
it: DEBUG : È stata trovata installata una versione di DaVinci Resolve che al momento non è supportata.

source: Please visit the GitHub page to find which version of DaVinci Resolve are supported.
it: Per favore, visita la pagina di GitHub per scoprire quali versioni di DaVinci Resolve sono supportate.

source: The libraries were already moved inside the secure folder. There was no need to do anything.
it: Le librerie sono già state sportate nella cartelle sicura. Non c'è stato bisogno di fare altro.

source: The following libraries will be moved in a secure folder :
it: Le seguenti librerie saranno spostate in una cartella sicura :

source: DEBUG : It was impossible to create the secure folder where to move the libraries in /opt/resolve/libs/disabled_libraries.
it: DEBUG : È stato impossibile creare una cartella sicura in cui spostare le librerie in /opt/resolve/libs/disabled_libraries.

source: Try again granting the app root permission or create it by yourself.
it: Prova di nuovo concedendo all'app i permessi di root o crea la cartella tu stesso.

source: DEBUG : There was an error moving the libraries inside the secure folder in /opt/resolve/libs/disabled_libraries. Try again granting the app root permission or move it by yourself.
it: DEBUG : C'è stato un errore durante lo spostamento delle librerie nella cartella sicura in/opt/resolve/libs/disabled_libraries. Prova di nuovo concedendo all'app i permessidi root o spostala tu stesso.

source: The libraries were correctly moved inside the secure folder.
it: Le librerie sono state spostate correttamente nella cartella sicura.

source: A compatible Nvidia GPU was found : {gpu_name_placeholder}
it: Una GPU Nvidia compatibile è stata trovata : {gpu_name_placeholder}

source: A compatible AMD GPU was found : {gpu_name_placeholder}
it: Una GPU AMD compatibile è stata trovata : {gpu_name_placeholder}

source: A compatible Intel GPU was found : {gpu_name_placeholder}
it: Una GPU Intel compatibile è stata trovata : {gpu_name_placeholder}

source: DEBUG : No supported GPU has been found inside your system.
it: DEBUG : Nessuna GPU supportata è stata trovata nel tuo sistema.

source: If you know that you have a DaVinci Resolve compatible GPU,
it: Se sai di avere una GPU compatibile con DaVinci resolve,

source: please open an issue and paste this error code on the project GitHub page :
it: per favore, apri una segnalazione e incolla questo codice di errore sulla pagina GitHub del progetto :

source: The RPM Fusion repository had already been added to the system, there was no need to add it.
it: Il repository RPM Fusion era già presente nel sistema, non c'è stato bisogno di aggiungerlo.

source: DEBUG : It was impossible to add the RPM Fusion Free and Non-Free repository.
it: DEBUG : È stato impossibile aggiungere i repository RPM Fusion Free e Non-Free.

source: Check your network connection and try again or add it by yourself.
it: Controlla la tua connessione ad internet e prova di nuovo oppure aggiungili tu stesso.

source: The RPM Fusion Free and Non-Free repository have been successfully added.
it: I repository RPM Fusion Free e Non-Free sono stati aggiunti con successo.

source: The proprietary Nvidia GPU driver was already installed on the system, there was no need to install it.
it: Il driver proprietario della GPU Nvidia era già installato nel sistema, non c'è stato bisogno di installarlo.

source: DEBUG : It was impossible to install the proprietary Nvidia GPU driver.
it: DEBUG : È stato impossibile installare il driver proprietario della GPU Nvidia.

source: Check your network connection and try again or install it by yourself.
it: Controlla la tua connessione ad internet e prova di nuovo o installalo tu stesso.

source: The proprietary Nvidia GPU driver has been successfully installed.
it: Il driver proprietario della GPU Nvidia è stato installato con successo.

source: The open source AMD GPU driver was already installed on the system, there was no need to install it.
it: Il driver open source della GPU AMD era già installato nel sistema, non c'è stato bisogno di installarlo.

source: DEBUG : It was impossible to install the open source AMD GPU driver.
it: DEBUG : È stato impossibile installare il driver open source della GPU AMD.
