Repository: H3rz3n/davinci-helper
Catalog: davinci-helper/locale/*/LC_MESSAGES/davinci-helper.po
Languages: it

source: The MESA Freeworld drivers were already installed on the system, there was no need to install it.
it: I driver MESA Freeworld erano già installati nel sistema, non c'è statobisogno di installarli.

source: The open source AMD GPU driver has been successfully installed.
it: Il driver open source della GPU AMD è stato installato con successo.

source: DEBUG : It was impossible to install the drivers for your GPU because it is currently not supported by this app.
it: DEBUG : È stato impossibile installare i driver per la tua GPU perchè al momento non è supportata da questa app.

source: If you know that your GPU is supported by DaVinci Resolve please open an issue report on the project GitHub page :
it: Se sai che la tua GPU è supportata da DaVinci Resolve, per favore apri una segnalazione sulla pagina GitHub del progetto :

source: DEBUG : It was impossible to install FFMPEG from RPM Fusion.
it: DEBUG : È stato impossibile installare FFMPEG da RPM Fusion

source: FFMPEG was successfully installed from RPM Fusion. Now you can use DaVinci Converter
it: FFMPEG è stato installato con successo da RPM Fusion. Ora puoi usare DaVinci Converter

source: DEBUG : It was impossible to swap the lite version FFMPEG with the one from RPM Fusion.
it: DEBUG : È stato impossibile scambiare la versione Lite di FFMPEG con quella completa da RPM Fusion.

source: FFMPEG lite was successfully swapped with FFMPEG full from RPM Fusion. Now you can use DaVinci Converter
it: FFMPEG Lite è stato scambiato con successo con FFMPEG Full da RPM Fusion. Orapuoi usare DaVinci Converter

source: FFMPEG was already installed on the system there was no need to install it.
it: FFMPEG era già installato nel sistema non c'è stato bisogno di installarlo.

source: Moviepy python module was already installed. There was no need to install it
it: Il modulo Moviepy python era già installato. Non c'è stato bisogno di installarlo

source: DEBUG : It was impossible to install the python module moviepy.
it: DEBUG : È stato impossibile installare il modulo python Moviepy.

source: Moviepy python module was successfully installed. Now you can use DaVinci Converter
it: Il modulo moviepy python è stato installato con successo. Ora puoi usare DaVinci Converter

source: Install missing dependencies
it: Installa le dipendenze mancanti

source: Launch DaVinci Resolve installer
it: Avvia l'installer di DaVinci Resolve

source: Apply post installation fix
it: Applica le correzioni post installazione

source: Check and install GPU drivers
it: Controlla e installa i driver della GPU

source: The best DaVinci Resolve companion app on Linux
it: La migliore app di supporto per DaVinci Resolve su Linux

source: This app is created with the purpose of making it easier for Linux users to install and use DaVinci Resolve.
it: Questa app è creata con lo scopo semplificare l'installazione e l'utilizzo di DaVinci Resolve agli utenti Linux.

source: Features :
it: Caratteristiche :

source: Automatic and dynamic dependecies installation
it: Installazione automatica e dinamica delle dipendenze

source: Application of post install patch
it: Applicazione delle modifiche necessarie dopo l'installazione

source: Easy GPU Driver installation
it: Installazione semplice del driver della GPU

source: Brand new UI based on Adwaita
it: Nuova UI basata su Adwaita

source: Added support for video conversion
it: Supporto aggiuntivo per le conversioni dei video

source: Improved support for AMD GPUs
it: Supporto per le GPU AMD migliorato

source: Added light theme and theme switch
it: Aggiunta del tema chiaro e del cambio di tema

source: Improved performance
it: Performance migliorata

source: Added support for AMD GPUs.
it: Supporto aggiuntivo per le GPU AMD

source: Switched to GPL-3.0 license
it: Cambio della licenza in GPL-3.0

source: Initial release of DaVinci Helper.
it: Rilascio iniziale di DaVinci Helper.

source: Hi
it: Ciao

source: Load default settings
it: Carica le impostazioni di default

source: About this app
it: Informazioni su questa app

source: Start
it: Avvia

source: Start again
it: Avvia di nuovo

source: Close
it: Chiudi

source: Download
it: Scarica

source: Video quality
it: Qualità del video

source: Original
it: Originale

source: High
it: Alta

source: Medium
it: Media

source: Low
it: Bassa

source: Audio quality
it: Qualità dell'audio

source: Convert
it: Converti

source: Load files
it: Carica i file

source: Clean list
it: Svuota la lista

source: Install
it: Installa

source: Cancel
it: Cancella
